// Task 35
// -   Напишите код, который переворачивает исходный массив и сохраняет это в новую переменную.
// -   Например: исходный массив - [1, 2, 3], результирующий массив - [3, 2, 1]

// let arr = [1, 2, 3]
// let arr2 = arr.reverse()
// console.log(arr2)

// Task 36
// -   Создать массив из 20 чисел. Необходимо высчитать сумму всех элементов.(Используем reduce)

// let numbers = [3 , 644, 75, 23, 8, 86, 3, 45, 56, 2, 87, 80, 334, 764, 565,375,  978, 586, 84, 6]
// let numbersSum = numbers.reduce((a, b) => a + b, 0)
// console.log(numbersSum)

// task 40
// -   Напишите функцию, которая очищает массив от нежелательных значений,
// -   таких как false, undefined, пустые строки, 0, null. В функции не должны использоваться конструкции for или for of для массивов. Используем методы.

// let arr = [0, 1, false, 2, undefined, '', null, 'Vlad'];
// let compact = (array) => array.filter((element) => element);
// console.log(compact(arr))
